## Terraform Plan Output
```
Acquiring state lock. This may take a few moments...
google_compute_subnetwork.web: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-me-central1-web]
google_compute_managed_ssl_certificate.halabag_ssl_managed: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/sslCertificates/halabag-ssl-managed]
google_compute_firewall.halabag_allow_health_checks_sharedvpc: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/firewalls/halabag-allow-health-checks]
google_compute_firewall.allow_cloudrun_to_cloudsql: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/firewalls/allow-cloudrun-to-cloudsql]
google_compute_global_address.halabag_global_lb_ip_sharedvpc: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/addresses/halabag-global-lb-ip]
google_compute_firewall.deny_all_ingress: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/firewalls/deny-all-ingress]
google_compute_firewall.allow_health_checks: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/firewalls/allow-health-checks]
google_compute_firewall.allow_sql_from_subnets: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/firewalls/allow-sql-from-subnets]
google_compute_firewall.allow_internal: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/firewalls/allow-internal]
google_compute_backend_service.halabag_default_backend_sharedvpc: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/backendServices/halabag-default-backend]
google_compute_firewall.halabag_deny_all_ingress_sharedvpc: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/firewalls/halabag-deny-all-ingress]
google_compute_subnetwork.vpc_subnet: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-vpc-subnet]
google_compute_target_https_proxy.halabag_global_https_sharedvpc: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/targetHttpsProxies/halabag-global-https-proxy]
google_compute_url_map.halabag_global_url_map_sharedvpc: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/urlMaps/halabag-global-url-map]
google_compute_firewall.halabag_allow_cloudrun_to_sql_sharedvpc: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/firewalls/halabag-allow-cloudrun-to-sql]
google_compute_subnetwork.app: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-me-central1-app]
google_project_iam_member.prod_artifact_registry_access: Refreshing state... [id=sinayah-halabag-sharedvpc/roles/artifactregistry.reader/serviceAccount:ci-artifact-pusher-prod@sinayah-halabag-prod.iam.gserviceaccount.com]
google_project_iam_binding.terraform_network_admin: Refreshing state... [id=sinayah-halabag-sharedvpc/roles/compute.networkAdmin]
google_project_iam_binding.terraform_dns_admin: Refreshing state... [id=sinayah-halabag-sharedvpc/roles/dns.admin]
google_artifact_registry_repository.halabag_prod_docker: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/locations/me-central2/repositories/halabag-prod-docker]
google_compute_network.vpc: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc]
google_service_account.cicd_sa: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/serviceAccounts/halabag-cicd-sa@sinayah-halabag-sharedvpc.iam.gserviceaccount.com]
google_project_iam_binding.terraform_sa_artifact_registry_admin: Refreshing state... [id=sinayah-halabag-sharedvpc/roles/artifactregistry.admin]
google_project_iam_member.dev_artifact_registry_access: Refreshing state... [id=sinayah-halabag-sharedvpc/roles/artifactregistry.reader/serviceAccount:ci-artifact-pusher-prod@sinayah-halabag-prod.iam.gserviceaccount.com]
google_project_iam_binding.cicd_artifact_registry_writer: Refreshing state... [id=sinayah-halabag-sharedvpc/roles/artifactregistry.writer]
google_service_account.network_sa: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/serviceAccounts/halabag-network-sa@sinayah-halabag-sharedvpc.iam.gserviceaccount.com]
google_compute_address.halabag_regional_lb_ip: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/regions/me-central2/addresses/halabag-hello-world-ip]
google_service_account.artifact_registry_sa: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/serviceAccounts/halabag-artifact-registry-sa@sinayah-halabag-sharedvpc.iam.gserviceaccount.com]
google_project_iam_binding.terraform_compute_admin: Refreshing state... [id=sinayah-halabag-sharedvpc/roles/compute.admin]
google_project_iam_binding.terraform_storage_admin: Refreshing state... [id=sinayah-halabag-sharedvpc/roles/storage.admin]
google_artifact_registry_repository.halabag_ci_docker: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/locations/me-central2/repositories/halabag-ci-docker]
google_compute_subnetwork.connector: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/regions/me-central2/subnetworks/halabag-connector-subnet]
google_compute_subnetwork.db: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-me-central1-db]
google_compute_subnetwork.proxy: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/regions/me-central2/subnetworks/halabag-proxy-subnet]
google_compute_router.router: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/regions/me-central1/routers/halabag-router]
google_compute_global_address.psa_range: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/global/addresses/psa-range]
google_compute_router_nat.nat: Refreshing state... [id=sinayah-halabag-sharedvpc/me-central1/halabag-router/halabag-nat]
google_artifact_registry_repository_iam_binding.prod_docker_writer: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/locations/me-central2/repositories/halabag-prod-docker/roles/artifactregistry.writer]
google_artifact_registry_repository_iam_binding.ci_docker_writer: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/locations/me-central2/repositories/halabag-ci-docker/roles/artifactregistry.writer]
google_vpc_access_connector.halabag_vpc_connector: Refreshing state... [id=projects/sinayah-halabag-sharedvpc/locations/me-central2/connectors/halabag-vpc-connector]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_backend_service.halabag_default_backend_sharedvpc will be destroyed
  # (because google_compute_backend_service.halabag_default_backend_sharedvpc is not in configuration)
  - resource "google_compute_backend_service" "halabag_default_backend_sharedvpc" {
      - affinity_cookie_ttl_sec                       = 0 -> null
      - connection_draining_timeout_sec               = 300 -> null
      - creation_timestamp                            = "2026-02-11T02:28:14.482-08:00" -> null
      - custom_request_headers                        = [] -> null
      - custom_response_headers                       = [] -> null
      - enable_cdn                                    = false -> null
      - external_managed_migration_testing_percentage = 0 -> null
      - fingerprint                                   = "S6GfSTMqvCw=" -> null
      - generated_id                                  = 4750541992056973000 -> null
      - health_checks                                 = [] -> null
      - id                                            = "projects/sinayah-halabag-sharedvpc/global/backendServices/halabag-default-backend" -> null
      - load_balancing_scheme                         = "EXTERNAL" -> null
      - name                                          = "halabag-default-backend" -> null
      - port_name                                     = "http" -> null
      - project                                       = "sinayah-halabag-sharedvpc" -> null
      - protocol                                      = "HTTP" -> null
      - self_link                                     = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/backendServices/halabag-default-backend" -> null
      - session_affinity                              = "NONE" -> null
      - timeout_sec                                   = 30 -> null
    }

  # google_compute_firewall.allow_cloudrun_to_cloudsql will be destroyed
  # (because google_compute_firewall.allow_cloudrun_to_cloudsql is not in configuration)
  - resource "google_compute_firewall" "allow_cloudrun_to_cloudsql" {
      - creation_timestamp      = "2025-11-20T23:23:00.420-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/sinayah-halabag-sharedvpc/global/firewalls/allow-cloudrun-to-cloudsql" -> null
      - name                    = "allow-cloudrun-to-cloudsql" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - priority                = 1000 -> null
      - project                 = "sinayah-halabag-sharedvpc" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/firewalls/allow-cloudrun-to-cloudsql" -> null
      - source_ranges           = [
          - "10.10.40.0/28",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [
              - "3306",
            ] -> null
          - protocol = "tcp" -> null
        }
      - allow {
          - ports    = [
              - "3307",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_firewall.allow_health_checks will be destroyed
  # (because google_compute_firewall.allow_health_checks is not in configuration)
  - resource "google_compute_firewall" "allow_health_checks" {
      - creation_timestamp      = "2025-11-16T14:27:53.070-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/sinayah-halabag-sharedvpc/global/firewalls/allow-health-checks" -> null
      - name                    = "allow-health-checks" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - priority                = 1000 -> null
      - project                 = "sinayah-halabag-sharedvpc" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/firewalls/allow-health-checks" -> null
      - source_ranges           = [
          - "130.211.0.0/22",
          - "35.191.0.0/16",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [
              - "80",
              - "443",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_firewall.allow_internal will be destroyed
  # (because google_compute_firewall.allow_internal is not in configuration)
  - resource "google_compute_firewall" "allow_internal" {
      - creation_timestamp      = "2025-11-16T14:27:53.293-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/sinayah-halabag-sharedvpc/global/firewalls/allow-internal" -> null
      - name                    = "allow-internal" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - priority                = 1000 -> null
      - project                 = "sinayah-halabag-sharedvpc" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/firewalls/allow-internal" -> null
      - source_ranges           = [
          - "10.10.0.0/24",
          - "10.10.1.0/24",
          - "10.10.2.0/24",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [
              - "0-65535",
            ] -> null
          - protocol = "tcp" -> null
        }
      - allow {
          - ports    = [
              - "0-65535",
            ] -> null
          - protocol = "udp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "icmp" -> null
        }
    }

  # google_compute_firewall.allow_sql_from_subnets will be destroyed
  # (because google_compute_firewall.allow_sql_from_subnets is not in configuration)
  - resource "google_compute_firewall" "allow_sql_from_subnets" {
      - creation_timestamp      = "2025-11-16T14:27:53.315-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/sinayah-halabag-sharedvpc/global/firewalls/allow-sql-from-subnets" -> null
      - name                    = "allow-sql-from-subnets" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - priority                = 1000 -> null
      - project                 = "sinayah-halabag-sharedvpc" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/firewalls/allow-sql-from-subnets" -> null
      - source_ranges           = [
          - "10.10.0.0/24",
          - "10.10.1.0/24",
          - "10.10.2.0/24",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [
          - "cloudsql",
        ] -> null

      - allow {
          - ports    = [
              - "3306",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_firewall.deny_all_ingress will be destroyed
  # (because google_compute_firewall.deny_all_ingress is not in configuration)
  - resource "google_compute_firewall" "deny_all_ingress" {
      - creation_timestamp      = "2025-11-16T14:27:53.465-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/sinayah-halabag-sharedvpc/global/firewalls/deny-all-ingress" -> null
      - name                    = "deny-all-ingress" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - priority                = 65534 -> null
      - project                 = "sinayah-halabag-sharedvpc" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/firewalls/deny-all-ingress" -> null
      - source_ranges           = [
          - "0.0.0.0/0",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - deny {
          - ports    = [] -> null
          - protocol = "all" -> null
        }
    }

  # google_compute_firewall.halabag_allow_cloudrun_to_sql will be created
  + resource "google_compute_firewall" "halabag_allow_cloudrun_to_sql" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "halabag-allow-cloudrun-to-sql"
      + network            = "halabag-shared-vpc"
      + priority           = 1000
      + project            = "sinayah-halabag-sharedvpc"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.100.3.0/28",
        ]

      + allow {
          + ports    = [
              + "3306",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.halabag_allow_cloudrun_to_sql_sharedvpc will be destroyed
  # (because google_compute_firewall.halabag_allow_cloudrun_to_sql_sharedvpc is not in configuration)
  - resource "google_compute_firewall" "halabag_allow_cloudrun_to_sql_sharedvpc" {
      - creation_timestamp      = "2026-02-12T03:54:03.097-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/sinayah-halabag-sharedvpc/global/firewalls/halabag-allow-cloudrun-to-sql" -> null
      - name                    = "halabag-allow-cloudrun-to-sql" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - priority                = 1000 -> null
      - project                 = "sinayah-halabag-sharedvpc" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/firewalls/halabag-allow-cloudrun-to-sql" -> null
      - source_ranges           = [
          - "10.100.3.0/28",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [
          - "halabag-cloudsql",
        ] -> null

      - allow {
          - ports    = [
              - "3306",
              - "3307",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_firewall.halabag_allow_health_checks will be created
  + resource "google_compute_firewall" "halabag_allow_health_checks" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "halabag-allow-health-checks"
      + network            = "halabag-shared-vpc"
      + priority           = 1000
      + project            = "sinayah-halabag-sharedvpc"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "130.211.0.0/22",
          + "35.191.0.0/16",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.halabag_allow_health_checks_sharedvpc will be destroyed
  # (because google_compute_firewall.halabag_allow_health_checks_sharedvpc is not in configuration)
  - resource "google_compute_firewall" "halabag_allow_health_checks_sharedvpc" {
      - creation_timestamp      = "2026-02-12T03:54:03.306-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/sinayah-halabag-sharedvpc/global/firewalls/halabag-allow-health-checks" -> null
      - name                    = "halabag-allow-health-checks" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - priority                = 1000 -> null
      - project                 = "sinayah-halabag-sharedvpc" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/firewalls/halabag-allow-health-checks" -> null
      - source_ranges           = [
          - "130.211.0.0/22",
          - "35.191.0.0/16",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [
              - "80",
              - "443",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_firewall.halabag_allow_lb_proxy_to_backend will be created
  + resource "google_compute_firewall" "halabag_allow_lb_proxy_to_backend" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "halabag-allow-lb-proxy-to-backend"
      + network            = "halabag-shared-vpc"
      + priority           = 1000
      + project            = "sinayah-halabag-sharedvpc"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.100.2.0/24",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.halabag_deny_all_ingress_sharedvpc will be destroyed
  # (because google_compute_firewall.halabag_deny_all_ingress_sharedvpc is not in configuration)
  - resource "google_compute_firewall" "halabag_deny_all_ingress_sharedvpc" {
      - creation_timestamp      = "2026-02-12T03:54:03.308-08:00" -> null
      - description             = "Default deny all ingress traffic" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/sinayah-halabag-sharedvpc/global/firewalls/halabag-deny-all-ingress" -> null
      - name                    = "halabag-deny-all-ingress" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - priority                = 65534 -> null
      - project                 = "sinayah-halabag-sharedvpc" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/firewalls/halabag-deny-all-ingress" -> null
      - source_ranges           = [
          - "0.0.0.0/0",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - deny {
          - ports    = [] -> null
          - protocol = "all" -> null
        }
    }

  # google_compute_forwarding_rule.halabag_https_forwarding_rule will be created
  + resource "google_compute_forwarding_rule" "halabag_https_forwarding_rule" {
      + base_forwarding_rule  = (known after apply)
      + creation_timestamp    = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = "34.166.207.163"
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL_MANAGED"
      + name                  = "halabag-main-https-fw"
      + network               = "projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc"
      + network_tier          = (known after apply)
      + port_range            = "443"
      + project               = "sinayah-halabag-sharedvpc"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + recreate_closed_psc   = false
      + region                = "me-central2"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)
    }

  # google_compute_global_address.halabag_global_lb_ip_sharedvpc will be destroyed
  # (because google_compute_global_address.halabag_global_lb_ip_sharedvpc is not in configuration)
  - resource "google_compute_global_address" "halabag_global_lb_ip_sharedvpc" {
      - address            = "34.98.97.137" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2026-02-11T02:28:14.628-08:00" -> null
      - effective_labels   = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - id                 = "projects/sinayah-halabag-sharedvpc/global/addresses/halabag-global-lb-ip" -> null
      - label_fingerprint  = "vezUS-42LLM=" -> null
      - labels             = {} -> null
      - name               = "halabag-global-lb-ip" -> null
      - prefix_length      = 0 -> null
      - project            = "sinayah-halabag-sharedvpc" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/addresses/halabag-global-lb-ip" -> null
      - terraform_labels   = {
          - "goog-terraform-provisioned" = "true"
        } -> null
    }

  # google_compute_global_address.psa_range must be replaced
-/+ resource "google_compute_global_address" "psa_range" {
      ~ address            = "10.50.100.0" -> "10.200.0.0" # forces replacement
      ~ creation_timestamp = "2026-02-11T01:03:05.066-08:00" -> (known after apply)
      ~ id                 = "projects/sinayah-halabag-sharedvpc/global/addresses/psa-range" -> (known after apply)
      ~ label_fingerprint  = "vezUS-42LLM=" -> (known after apply)
      - labels             = {} -> null
      ~ name               = "psa-range" -> "halabag-psa-range" # forces replacement
      ~ network            = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> "projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc"
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/addresses/psa-range" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # google_compute_region_security_policy.halabag_regional_waf will be created
  + resource "google_compute_region_security_policy" "halabag_regional_waf" {
      + description              = "Regional WAF for halabag dev services"
      + fingerprint              = (known after apply)
      + id                       = (known after apply)
      + name                     = "halabag-regional-waf"
      + policy_id                = (known after apply)
      + project                  = "sinayah-halabag-sharedvpc"
      + region                   = "me-central2"
      + self_link                = (known after apply)
      + self_link_with_policy_id = (known after apply)

      + rules {
          + action   = "deny(403)"
          + priority = 1000

          + match {
              + expr {
                  + expression = "evaluatePreconfiguredExpr('sqli-v33-stable')"
                }
            }
        }
      + rules {
          + action   = "deny(403)"
          + priority = 1001

          + match {
              + expr {
                  + expression = "evaluatePreconfiguredExpr('xss-v33-stable')"
                }
            }
        }
      + rules {
          + action      = "allow"
          + description = "Default allow rule"
          + priority    = 2147483647

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "*",
                    ]
                }
            }
        }
    }

  # google_compute_region_target_https_proxy.halabag_regional_https_proxy will be created
  + resource "google_compute_region_target_https_proxy" "halabag_regional_https_proxy" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "halabag-main-https-proxy"
      + project            = "sinayah-halabag-sharedvpc"
      + proxy_id           = (known after apply)
      + region             = "me-central2"
      + self_link          = (known after apply)
      + ssl_certificates   = [
          + "projects/sinayah-halabag-sharedvpc/locations/me-central2/certificates/halabag-shared-cert",
        ]
      + url_map            = (known after apply)
    }

  # google_compute_region_url_map.halabag_regional_url_map will be created
  + resource "google_compute_region_url_map" "halabag_regional_url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = "projects/sinayah-halabag-dev/regions/me-central2/backendServices/halabag-portal-backend"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "halabag-main-url-map"
      + project            = "sinayah-halabag-sharedvpc"
      + region             = "me-central2"
      + self_link          = (known after apply)

      + host_rule {
          + hosts        = [
              + "customers.halabag.com",
            ]
          + path_matcher = "customers-matcher"
        }
      + host_rule {
          + hosts        = [
              + "portal.halabag.com",
            ]
          + path_matcher = "portal-matcher"
        }

      + path_matcher {
          + default_service = "projects/sinayah-halabag-dev/regions/me-central2/backendServices/halabag-customers-backend"
          + name            = "customers-matcher"
        }
      + path_matcher {
          + default_service = "projects/sinayah-halabag-dev/regions/me-central2/backendServices/halabag-portal-backend"
          + name            = "portal-matcher"
        }
    }

  # google_compute_router.router must be replaced
-/+ resource "google_compute_router" "router" {
      ~ creation_timestamp            = "2025-11-16T11:38:55.746-08:00" -> (known after apply)
      - encrypted_interconnect_router = false -> null
      ~ id                            = "projects/sinayah-halabag-sharedvpc/regions/me-central1/routers/halabag-router" -> (known after apply)
        name                          = "halabag-router"
      ~ network                       = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> "projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc"
      ~ region                        = "me-central1" -> "me-central2" # forces replacement
      ~ self_link                     = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/regions/me-central1/routers/halabag-router" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # google_compute_router_nat.nat must be replaced
-/+ resource "google_compute_router_nat" "nat" {
      + auto_network_tier                   = (known after apply)
      ~ drain_nat_ips                       = [] -> (known after apply)
      ~ enable_dynamic_port_allocation      = false -> (known after apply)
      ~ enable_endpoint_independent_mapping = false -> (known after apply)
      ~ endpoint_types                      = [
          - "ENDPOINT_TYPE_VM",
        ] -> (known after apply)
      ~ id                                  = "sinayah-halabag-sharedvpc/me-central1/halabag-router/halabag-nat" -> (known after apply)
      - max_ports_per_vm                    = 0 -> null
      ~ min_ports_per_vm                    = 0 -> (known after apply)
        name                                = "halabag-nat"
      ~ nat_ips                             = [] -> (known after apply)
      ~ region                              = "me-central1" -> "me-central2" # forces replacement
        # (10 unchanged attributes hidden)
    }

  # google_compute_subnetwork.app will be destroyed
  # (because google_compute_subnetwork.app is not in configuration)
  - resource "google_compute_subnetwork" "app" {
      - creation_timestamp         = "2025-11-16T08:38:48.569-08:00" -> null
      - gateway_address            = "10.10.1.1" -> null
      - id                         = "projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-me-central1-app" -> null
      - ip_cidr_range              = "10.10.1.0/24" -> null
      - name                       = "halabag-me-central1-app" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - private_ip_google_access   = true -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "sinayah-halabag-sharedvpc" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "me-central1" -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-me-central1-app" -> null
      - stack_type                 = "IPV4_ONLY" -> null
      - subnetwork_id              = 3457836945700569000 -> null
    }

  # google_compute_subnetwork.db must be replaced
-/+ resource "google_compute_subnetwork" "db" {
      ~ creation_timestamp         = "2025-11-16T08:38:46.257-08:00" -> (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      ~ gateway_address            = "10.10.2.1" -> (known after apply)
      ~ id                         = "projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-me-central1-db" -> (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      ~ ip_cidr_range              = "10.10.2.0/24" -> "10.100.1.0/24" # forces replacement
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      ~ name                       = "halabag-me-central1-db" -> "halabag-db-subnet" # forces replacement
      ~ network                    = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> "projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc"
      ~ private_ip_google_access   = true -> (known after apply)
      ~ private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> (known after apply)
      ~ purpose                    = "PRIVATE" -> (known after apply)
      ~ region                     = "me-central1" -> "me-central2" # forces replacement
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-me-central1-db" -> (known after apply)
      ~ stack_type                 = "IPV4_ONLY" -> (known after apply)
      + state                      = (known after apply)
      ~ subnetwork_id              = 2593249016719622000 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # google_compute_subnetwork.vpc_subnet will be destroyed
  # (because google_compute_subnetwork.vpc_subnet is not in configuration)
  - resource "google_compute_subnetwork" "vpc_subnet" {
      - creation_timestamp         = "2025-11-19T06:52:46.785-08:00" -> null
      - gateway_address            = "10.10.40.1" -> null
      - id                         = "projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-vpc-subnet" -> null
      - ip_cidr_range              = "10.10.40.0/24" -> null
      - name                       = "halabag-vpc-subnet" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - private_ip_google_access   = false -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "sinayah-halabag-sharedvpc" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "me-central1" -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-vpc-subnet" -> null
      - stack_type                 = "IPV4_ONLY" -> null
      - subnetwork_id              = 3454551858359593000 -> null
    }

  # google_compute_subnetwork.web will be destroyed
  # (because google_compute_subnetwork.web is not in configuration)
  - resource "google_compute_subnetwork" "web" {
      - creation_timestamp         = "2025-11-16T08:38:47.757-08:00" -> null
      - gateway_address            = "10.10.0.1" -> null
      - id                         = "projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-me-central1-web" -> null
      - ip_cidr_range              = "10.10.0.0/24" -> null
      - name                       = "halabag-me-central1-web" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc" -> null
      - private_ip_google_access   = true -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "sinayah-halabag-sharedvpc" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "me-central1" -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/sinayah-halabag-sharedvpc/regions/me-central1/subnetworks/halabag-me-central1-web" -> null
      - stack_type                 = "IPV4_ONLY" -> null
      - subnetwork_id              = 6160182019896918000 -> null
    }

  # google_compute_subnetwork_iam_member.dev_run_agent_subnet_user will be created
  + resource "google_compute_subnetwork_iam_member" "dev_run_agent_subnet_user" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:service-856971603968@serverless-robot-prod.iam.gserviceaccount.com"
      + project    = "sinayah-halabag-sharedvpc"
      + region     = "me-central2"
      + role       = "roles/compute.networkUser"
      + subnetwork = "halabag-connector-subnet"
    }

  # google_project_iam_member.dev_run_agent_on_host_vpc will be created
  + resource "google_project_iam_member" "dev_run_agent_on_host_vpc" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-856971603968@serverless-robot-prod.iam.gserviceaccount.com"
      + project = "sinayah-halabag-sharedvpc"
      + role    = "roles/vpcaccess.user"
    }

  # google_project_iam_member.host_lb_agent_on_dev will be created
  + resource "google_project_iam_member" "host_lb_agent_on_dev" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:225974559156@cloudservices.gserviceaccount.com"
      + project = "sinayah-halabag-dev"
      + role    = "roles/compute.loadBalancerAdmin"
    }

  # google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = "projects/sinayah-halabag-sharedvpc/global/networks/halabag-shared-vpc"
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "halabag-psa-range",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

Plan: 15 to add, 0 to change, 17 to destroy.

Changes to Outputs:
  + regional_waf_policy_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentterraform-plan -->